In [22]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [27]:
arr = np.arange(12.).reshape((3,4))
arr-arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

# pandas
* dataframe (excel -> table)
* series (excel -> column)

### making series from:
- list
- tuple 
- dict
- 1d array

In [42]:
s1 = pd.Series([10,12,13,14]) # list
s2 = pd.Series((11,12,13,14)) # tuple
s2 = pd.Series((11,12,13,14), index= ["a","b","c","d"], name = "student_num") #index replacement, naming series
s2.index.name = "ID" #renaming index
print(s1, s2, sep="\n\n")

0    10
1    12
2    13
3    14
dtype: int64

ID
a    11
b    12
c    13
d    14
Name: student_num, dtype: int64

renaming index

In [139]:
s2 = pd.Series((11,12,13,14), index= ["a","b","c","d"], name = "student_num")
s2.index = [4,3,6,5] # rename
s2 = s2.reindex([3,4,5,6,7,8]) # rearrange
s2

3    12.0
4    11.0
5    14.0
6    13.0
7     NaN
8     NaN
Name: student_num, dtype: float64

In [140]:
s2.reindex([1,2,3,4,5,6], method="bfill")

1    12.0
2    12.0
3    12.0
4    11.0
5    14.0
6    13.0
Name: student_num, dtype: float64

In [141]:
dic = {"a":1,
      "b":2,
      "c":3,
      "d":4}
s3 = pd.Series(dic) #key -> index
s3

a    1
b    2
c    3
d    4
dtype: int64

In [142]:
#1d array to series
a = np.arange(10,20)
l = a.tolist()
s4 = pd.Series(l) #or pd.Series(list(a))
s4

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int64

### dataframe from:
- 2d array/ numpy structure/record
- list of list
- list of tuple
- list of dic
- dic of list
- dic of series
- dic of dic

In [147]:
#2d array to dataframe
a = np.arange(3)
a

array([0, 1, 2])

In [150]:
a = np.arange(3)
df2 = pd.DataFrame(a)
#df2.columns=['a', 'b', 'c']
df2

   0
0  0
1  1
2  2

In [29]:
df1 = pd.DataFrame(np.random.randint(1,100,size=(100,5)), columns=["math", "eng", "urdu", "phy", "chem"]) #100 rows 5 col, range for values is 1-100
df1

    math  eng  urdu  phy  chem
0     85   43     1   36    39
1     66   12    13    8    34
2     71   16    70   59    39
3     42   43    27   54    32
4     83   68    50   16    13
5     22   95    94   26    93
6     15   20    24    4     8
7     52   77     2   62    42
8     44    7    80   56    36
9     95   56    99   71    26
10    55   74    90   50    33
11    33   34    42   29     7
12    47   95    95   30    40
13    69    8    61   42    83
14    34   89    79   65    72
15    81   13    69   97    37
16    24   43     7   22    59
17    15   93    68   26    75
18    98   35    71   55    87
19    62   85    85   61    60
20    88   14    44   81    87
21    10   76    16   16    91
22    47   96    60    3    64
23    57   19    26    2    79
24    32   16    21   46    17
25     7   36    81   98    37
26    74   35     6   87    25
27    15   32    42   83    99
28    24   17    61   78    80
29     6    4    14   73    39
..   ...  ...   ...  ...   ...
70    19   97    86   74    78
71    29   32    48   47    94
72    52   30    97   99    92
73    14   48    79   40    24
74    77    8    32    7    53
75    38   37    46   40    78
76    70   45    15   69    33
77    87   36    46   90    88
78    64   37    61    3    82
79    81   88    12   13    70
80    34   10    31   49    62
81    83   27    92   53     2
82    47   23    47   47    60
83    53   76    66    4     1
84    24    2    97   37    11
85    27   36    57   77    69
86    21   30    37   21    54
87    42   56    72   58    19
88    76   25    54    1     3
89    46   83    21   55     9
90    85   69    81   19     9
91    53   64    39    5    86
92    75   36    52   46    51
93     9   21    26   98    48
94    78   60     4   56    18
95    97   86    33    7    61
96    78   14    15   84    35
97     1   54    24   95    86
98    96   12    24   99    74
99    62   89    17   24    38

[100 rows x 5 columns]

In [2]:
#list of list
#id, name, course, fee
data = [[1, "aisha", "AI", 1200],
       [2, "soni", "AI", 1200],
       [3, "wardi", "CNC", 1300],
       [4, "khola", "CNC", 1300]]
data

[[1, 'aisha', 'AI', 1200],
 [2, 'soni', 'AI', 1200],
 [3, 'wardi', 'CNC', 1300],
 [4, 'khola', 'CNC', 1300]]

In [3]:
df1 = pd.DataFrame(data)
df1

   0      1    2     3
0  1  aisha   AI  1200
1  2   soni   AI  1200
2  3  wardi  CNC  1300
3  4  khola  CNC  1300

In [154]:
df1 = pd.DataFrame(data, columns=["ID","name","course","fee"]) #or index = range(1,6)
df1.index = range(1,5)
df3 = df1.copy(True)
print(id(df1) == id(df3))
df3.dtypes
df3.fee = 30
df3

False

   ID   name course  fee
1   1  aisha     AI   30
2   2   soni     AI   30
3   3  wardi    CNC   30
4   4  khola    CNC   30

In [155]:
#list of tuple

In [3]:
data = [(1, "aisha", "AI", 1200),
       (2, "soni", "AI", 1200),
       (3, "wardi", "CNC", 1300),
       (4, "khola", "CNC", 1300)]
data

[(1, 'aisha', 'AI', 1200),
 (2, 'soni', 'AI', 1200),
 (3, 'wardi', 'CNC', 1300),
 (4, 'khola', 'CNC', 1300)]

In [4]:
df1 = pd.DataFrame(data, columns=["ID","name","course","fee"], index = range(1,5))

In [5]:
#dict of list

In [6]:
d1 = {"ID": [1,2,3,4,5],
      "name": ["aisha","soni","wardi","khola","shamo"],
      "course":["AI","AI","CNC","CNC","AIOT"],
      "fee":[1200, 1200, 1300, 1300, 1500]}
df1 = pd.DataFrame(d1)
df1

   ID   name course   fee
0   1  aisha     AI  1200
1   2   soni     AI  1200
2   3  wardi    CNC  1300
3   4  khola    CNC  1300
4   5  shamo   AIOT  1500

In [7]:
#dic of series

In [8]:
d1 = {"a":pd.Series([1,2,3]),
      "b":pd.Series([3,4,5]),
     }
pd.DataFrame(d1)

   a  b
0  1  3
1  2  4
2  3  5

In [9]:
#dic of dic

In [10]:
d1 = {"a":{0:1,1:5,2:3},
      "b":{0:1,1:2,2:3},
      "c":{0:1,1:2,2:3}
     }
pd.DataFrame(d1)

   a  b  c
0  1  1  1
1  5  2  2
2  3  3  3

In [11]:
#list of dic

In [12]:
l = [{"a":1,"b":5,"c":3},{"a":1,"b":15,"c":3},{"a":1,"b":25,"c":3}]
pd.DataFrame(l)

   a   b  c
0  1   5  3
1  1  15  3
2  1  25  3

# get general information from data frame

In [13]:
d1 = {"ID": [1,2,3,4],
      "name": ["aisha","soni","wardi","khola"],
      "course":["AI","AI","CNC","CNC"],
      "fee":[1200, 1200, 1300, 1300]}
df1 = pd.DataFrame(d1)
df1

   ID   name course   fee
0   1  aisha     AI  1200
1   2   soni     AI  1200
2   3  wardi    CNC  1300
3   4  khola    CNC  1300

In [14]:
#dataframe.info()
#dataframe.describe()
#dataframe.dtypes
#dataframe.columns
#dataframe.index
#dataframe.values
#dataframe.isnull()
#dataframe.isnull().sum()
#dataframe.notnull()
#dataframe.notnull().sum
#dataframe.head(n=5)
#dataframe.tail()
#dataframe.apply() #pass user define function

In [15]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
ID        4 non-null int64
name      4 non-null object
course    4 non-null object
fee       4 non-null int64
dtypes: int64(2), object(2)
memory usage: 208.0+ bytes

In [16]:
df1.describe()

             ID          fee
count  4.000000     4.000000
mean   2.500000  1250.000000
std    1.290994    57.735027
min    1.000000  1200.000000
25%    1.750000  1200.000000
50%    2.500000  1250.000000
75%    3.250000  1300.000000
max    4.000000  1300.000000

In [17]:
df1.columns

Index(['ID', 'name', 'course', 'fee'], dtype='object')

In [18]:
df1.dtypes

ID         int64
name      object
course    object
fee        int64
dtype: object

In [19]:
df1.index

RangeIndex(start=0, stop=4, step=1)

In [20]:
df1.values

array([[1, 'aisha', 'AI', 1200],
       [2, 'soni', 'AI', 1200],
       [3, 'wardi', 'CNC', 1300],
       [4, 'khola', 'CNC', 1300]], dtype=object)

In [21]:
len(df1) #count of rows

4

In [2]:
d1 = {"ID": [1,2,3,4],
      "name": ["aisha",None,"wardi",np.nan],
      "course":["AI","AI","CNC","CNC"],
      "fee":[1200, 1200, 1300, 1300]}
df1 = pd.DataFrame(d1)
df1

   ID   name course   fee
0   1  aisha     AI  1200
1   2   None     AI  1200
2   3  wardi    CNC  1300
3   4    NaN    CNC  1300

In [23]:
df1.isnull()

      ID   name  course    fee
0  False  False   False  False
1  False   True   False  False
2  False  False   False  False
3  False   True   False  False

In [24]:
df1.isnull().sum()

ID        0
name      2
course    0
fee       0
dtype: int64

In [25]:
df1.notnull().sum()

ID        4
name      2
course    4
fee       4
dtype: int64

In [26]:
df1.count()

ID        4
name      2
course    4
fee       4
dtype: int64

In [27]:
df1.head(3)

   ID   name course   fee
0   1  aisha     AI  1200
1   2   None     AI  1200
2   3  wardi    CNC  1300

In [28]:
df1.tail(2)

   ID   name course   fee
2   3  wardi    CNC  1300
3   4    NaN    CNC  1300

In [29]:
df1.sum(axis=0)

ID                10
course    AIAICNCCNC
fee             5000
dtype: object

In [30]:
df1.sum(axis=0)[["ID","fee"]]

ID       10
fee    5000
dtype: object

In [31]:
df1

   ID   name course   fee
0   1  aisha     AI  1200
1   2   None     AI  1200
2   3  wardi    CNC  1300
3   4    NaN    CNC  1300

In [32]:
#extract series from df
# df.columnName
# df["columName"] (if space in between col name)

In [33]:
df1.fee

0    1200
1    1200
2    1300
3    1300
Name: fee, dtype: int64

In [3]:
# add new col in df
#df["newcolname"] (always use [] to add col)

df1["updated fee"] = 1220 #or [2200,2200,3300,3300]
df1

   ID   name course   fee  updated fee
0   1  aisha     AI  1200         1220
1   2   None     AI  1200         1220
2   3  wardi    CNC  1300         1220
3   4    NaN    CNC  1300         1220

In [35]:
df1.name

0    aisha
1     None
2    wardi
3      NaN
Name: name, dtype: object

In [36]:
df1["updated fee"] #bcz of space in col name use only this method

0    1220
1    1220
2    1220
3    1220
Name: updated fee, dtype: int64

In [37]:
df1.columns

Index(['ID', 'name', 'course', 'fee', 'updated fee'], dtype='object')

In [38]:
df1

   ID   name course   fee  updated fee
0   1  aisha     AI  1200         1220
1   2   None     AI  1200         1220
2   3  wardi    CNC  1300         1220
3   4    NaN    CNC  1300         1220

In [39]:
df1.reindex([1,2,3,4]) #rearrange row indexes

    ID   name course     fee  updated fee
1  2.0   None     AI  1200.0       1220.0
2  3.0  wardi    CNC  1300.0       1220.0
3  4.0    NaN    CNC  1300.0       1220.0
4  NaN    NaN    NaN     NaN          NaN

In [40]:
df1.columns

Index(['ID', 'name', 'course', 'fee', 'updated fee'], dtype='object')

In [6]:
df1.reindex(columns=["fee","ID","new"]) #rearrange col indexes

    fee  ID  new
0  1200   1  NaN
1  1200   2  NaN
2  1300   3  NaN
3  1300   4  NaN

# apply general function on series

In [42]:
#dataframe.column.apply()  (pass user defined func)-->use map and apply to replace values
#dataframe.column.unique()
#dataframe.column.map()    (pass dict(map finds key and replace with value))
#dataframe.column.value_counts()
#dataframe.column.sum() #min,max,mean,std

In [43]:
df1

   ID   name course   fee  updated fee
0   1  aisha     AI  1200         1220
1   2   None     AI  1200         1220
2   3  wardi    CNC  1300         1220
3   4    NaN    CNC  1300         1220

In [44]:
dic = {}
for i, v in enumerate(df1.course.unique()):
    dic[v] = i
dic

{'AI': 0, 'CNC': 1}

In [45]:
df1["updated course"] = df1.course.map(dic)
df1

   ID   name course   fee  updated fee  updated course
0   1  aisha     AI  1200         1220               0
1   2   None     AI  1200         1220               0
2   3  wardi    CNC  1300         1220               1
3   4    NaN    CNC  1300         1220               1

In [46]:
d1 = {
    "AI":"A.I",
    "CNC":"CN",
    None:0    #replace none with 0
}


df1["course"] = df1.course.map(d1)
df1

   ID   name course   fee  updated fee  updated course
0   1  aisha    A.I  1200         1220               0
1   2   None    A.I  1200         1220               0
2   3  wardi     CN  1300         1220               1
3   4    NaN     CN  1300         1220               1

dataframe.column.unique()

In [47]:
df1.course.unique()

array(['A.I', 'CN'], dtype=object)

dataframe.column.value_counts()

In [48]:
for v in df1.course.unique():
    print(v, len(df1[df1.course == v]))

A.I 2
CN 2

In [49]:
df1.course.value_counts()

CN     2
A.I    2
Name: course, dtype: int64

In [50]:
df1.fee.sum()

5000

In [51]:
df1["updated fee"].sum()

4880

In [52]:
df1.fee.max()

1300

In [53]:
df1.fee.min()

1200

In [54]:
df1.fee.std()

57.735026918962575

In [55]:
df1.fee.mean()

1250.0

dataframe[dataframe.col == value] #one filter
dataframe[(dataframe.col == value) & (dataframe.col == value)]

### apply function

In [56]:
df1

   ID   name course   fee  updated fee  updated course
0   1  aisha    A.I  1200         1220               0
1   2   None    A.I  1200         1220               0
2   3  wardi     CN  1300         1220               1
3   4    NaN     CN  1300         1220               1

In [57]:
def update(x):
    if x == "AI":
        return 2000
    elif x == "CNC":
        return 1800
    elif x == "AIOT":
        return 1300
    else:
        return 0

In [58]:
df1["updated fee"] = df1.course.apply(update)
df1

   ID   name course   fee  updated fee  updated course
0   1  aisha    A.I  1200            0               0
1   2   None    A.I  1200            0               0
2   3  wardi     CN  1300            0               1
3   4    NaN     CN  1300            0               1

In [59]:
df2 = pd.DataFrame(np.random.randint(1,100, size=(4,5)), columns=["c1","c2","c3","c4","c5"])
df2

   c1  c2  c3  c4  c5
0  54  80  66   9  71
1  89  30  32  20  23
2  29  38  47  79  58
3  75  29  82  36  13

In [60]:
df2.iloc[0:2]

   c1  c2  c3  c4  c5
0  54  80  66   9  71
1  89  30  32  20  23

In [61]:
df2.loc[0:2] #usually for label vise slicing # end point is inclusive

   c1  c2  c3  c4  c5
0  54  80  66   9  71
1  89  30  32  20  23
2  29  38  47  79  58

In [62]:
np.random.randint(1,100, size=(6,5))

array([[ 4, 85, 18, 53, 36],
       [60, 58,  3, 79, 94],
       [23, 39, 50,  5, 29],
       [86, 81,  7, 36, 48],
       [21, 90, 62, 45, 56],
       [18, 97, 92, 92, 84]])

# pd.concat

In [67]:
pd.concat([df1,df2], ignore_index=True) #axis = 0, concat columnwise (top to bottom)

C:\Users\DMEO\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

,ID,c1,c2,c3,c4,c5,course,fee,name,updated course,updated fee
0,1.0,NaN,NaN,NaN,NaN,NaN,A.I,1200.0,aisha,0.0,0.0
1,2.0,NaN,NaN,NaN,NaN,NaN,A.I,1200.0,None,0.0,0.0
2,3.0,NaN,NaN,NaN,NaN,NaN,CN,1300.0,wardi,1.0,0.0
3,4.0,NaN,NaN,NaN,NaN,NaN,CN,1300.0,NaN,1.0,0.0
4,NaN,54.0,80.0,66.0,9.0,71.0,NaN,NaN,NaN,NaN,NaN
5,NaN,89.0,30.0,32.0,20.0,23.0,NaN,NaN,NaN,NaN,NaN
6,NaN,29.0,38.0,47.0,79.0,58.0,NaN,NaN,NaN,NaN,NaN
7,NaN,75.0,29.0,82.0,36.0,13.0,NaN,NaN,NaN,NaN,NaN

In [64]:
df = pd.concat([df1,df2], axis = 1) #concat rowwise (left to right)
df

   ID   name course   fee  updated fee  updated course  c1  c2  c3  c4  c5
0   1  aisha    A.I  1200            0               0  54  80  66   9  71
1   2   None    A.I  1200            0               0  89  30  32  20  23
2   3  wardi     CN  1300            0               1  29  38  47  79  58
3   4    NaN     CN  1300            0               1  75  29  82  36  13

In [44]:
df["total"] = df.c1 + df.c2 + df.c3 + df.c4 + df.c5
df["percentage"] = (df.c1 + df.c2 + df.c3 + df.c4 + df.c5)/500*100
df

,ID,name,course,fee,updated fee,updated course,c1,c2,c3,c4,c5,total,percentage
0,1,aisha,AI,1200,2000,0,24,81,77,95,73,350,70.0
1,2,soni,AI,1200,2000,0,31,8,9,92,59,199,39.8
2,3,wardi,CNC,1300,1800,1,65,66,71,97,21,320,64.0
3,4,khola,CNC,1300,1800,1,15,39,58,17,46,175,35.0
4,5,shamo,AIOT,1500,1300,2,31,11,9,82,86,219,43.8

In [45]:
def grade(p):
    if p >= 80:
        return "A"
    elif p >= 70:
        return "B"
    elif p >= 60:
        return "C"
    elif p >= 50:
        return "D"
    else:
        return "F"
df["grade"] = df.percentage.apply(grade)
df

,ID,name,course,fee,updated fee,updated course,c1,c2,c3,c4,c5,total,percentage,grade
0,1,aisha,AI,1200,2000,0,24,81,77,95,73,350,70.0,B
1,2,soni,AI,1200,2000,0,31,8,9,92,59,199,39.8,F
2,3,wardi,CNC,1300,1800,1,65,66,71,97,21,320,64.0,C
3,4,khola,CNC,1300,1800,1,15,39,58,17,46,175,35.0,F
4,5,shamo,AIOT,1500,1300,2,31,11,9,82,86,219,43.8,F

course = AI -> c1--c5.sum()
course = CNC -> c1--c5.product()
course = AIOT -> c1--c5.cumsum().sum()
else 0

In [23]:
def functions(course,c1,c2,c3,c4,c5):
    if course == "AI":
        return np.array([c1,c2,c3,c4,c5]).sum()
    elif course == "CNC":
        return np.array([c1,c2,c3,c4,c5]).prod()
    elif course == "AIOT":
        return sum(np.array([c1,c2,c3,c4,c5]).cumsum())

In [64]:
df["check validation"] = df[["course","c1","c2","c3","c4","c5"]].apply(lambda x:functions(*x), axis = 1)
df

,ID,name,course,fee,updated fee,updated course,c1,c2,c3,c4,c5,total,percentage,grade,check validation
0,1,aisha,AI,1200,2000,0,24,81,77,95,73,350,70.0,B,350
1,2,soni,AI,1200,2000,0,31,8,9,92,59,199,39.8,F,199
2,3,wardi,CNC,1300,1800,1,65,66,71,97,21,320,64.0,C,620449830
3,4,khola,CNC,1300,1800,1,15,39,58,17,46,175,35.0,F,26533260
4,5,shamo,AIOT,1500,1300,2,31,11,9,82,86,219,43.8,F,476

apply(axis=1) will apply function rowwise(left to right) bcz apply function works on series by default axis = 0

# sort
- by index
- by values

In [268]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [272]:
obj.sort_values() #nans are sorted to the end

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [78]:
df.sort_index(ascending=False)

,ID,name,course,fee,updated fee,updated course,c1,c2,c3,c4,c5,total,percentage,grade,check validation
4,5,shamo,AIOT,1500,1300,2,31,11,9,82,86,219,43.8,F,476
3,4,khola,CNC,1300,1800,1,15,39,58,17,46,175,35.0,F,26533260
2,3,wardi,CNC,1300,1800,1,65,66,71,97,21,320,64.0,C,620449830
1,2,soni,AI,1200,2000,0,31,8,9,92,59,199,39.8,F,199
0,1,aisha,AI,1200,2000,0,24,81,77,95,73,350,70.0,B,350

In [79]:
df.sort_index(axis = 1)

,ID,c1,c2,c3,c4,c5,check validation,course,fee,grade,name,percentage,total,updated course,updated fee
0,1,24,81,77,95,73,350,AI,1200,B,aisha,70.0,350,0,2000
1,2,31,8,9,92,59,199,AI,1200,F,soni,39.8,199,0,2000
2,3,65,66,71,97,21,620449830,CNC,1300,C,wardi,64.0,320,1,1800
3,4,15,39,58,17,46,26533260,CNC,1300,F,khola,35.0,175,1,1800
4,5,31,11,9,82,86,476,AIOT,1500,F,shamo,43.8,219,2,1300

In [80]:
df.sort_index(ascending=False, axis = 1)

,updated fee,updated course,total,percentage,name,grade,fee,course,check validation,c5,c4,c3,c2,c1,ID
0,2000,0,350,70.0,aisha,B,1200,AI,350,73,95,77,81,24,1
1,2000,0,199,39.8,soni,F,1200,AI,199,59,92,9,8,31,2
2,1800,1,320,64.0,wardi,C,1300,CNC,620449830,21,97,71,66,65,3
3,1800,1,175,35.0,khola,F,1300,CNC,26533260,46,17,58,39,15,4
4,1300,2,219,43.8,shamo,F,1500,AIOT,476,86,82,9,11,31,5

sort by values:
* df.sort_values("c1")
* df.sort_values(by=["c1","c2","c3"], ascending=[True,True,False])

In [82]:
#descending order by percentage
df.sort_values("percentage",ascending=False)

,ID,name,course,fee,updated fee,updated course,c1,c2,c3,c4,c5,total,percentage,grade,check validation
0,1,aisha,AI,1200,2000,0,24,81,77,95,73,350,70.0,B,350
2,3,wardi,CNC,1300,1800,1,65,66,71,97,21,320,64.0,C,620449830
4,5,shamo,AIOT,1500,1300,2,31,11,9,82,86,219,43.8,F,476
1,2,soni,AI,1200,2000,0,31,8,9,92,59,199,39.8,F,199
3,4,khola,CNC,1300,1800,1,15,39,58,17,46,175,35.0,F,26533260

In [83]:
#descending percentage + course wise
df.sort_values(by=["course", "percentage"], ascending=[True, False])

,ID,name,course,fee,updated fee,updated course,c1,c2,c3,c4,c5,total,percentage,grade,check validation
0,1,aisha,AI,1200,2000,0,24,81,77,95,73,350,70.0,B,350
1,2,soni,AI,1200,2000,0,31,8,9,92,59,199,39.8,F,199
4,5,shamo,AIOT,1500,1300,2,31,11,9,82,86,219,43.8,F,476
2,3,wardi,CNC,1300,1800,1,65,66,71,97,21,320,64.0,C,620449830
3,4,khola,CNC,1300,1800,1,15,39,58,17,46,175,35.0,F,26533260

# rank()

In [312]:
obj = pd.Series([4, 3, 7, 9, -3, 2,])
o = pd.Series([7, -5, 7, 4, 2, 0, 4])
o.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [295]:
obj = pd.Series([6,5,4,4,3,2])
obj.rank(method="first")

0    6.0
1    5.0
2    3.0
3    4.0
4    2.0
5    1.0
dtype: float64

# load data

In [ ]:
df = pd.read_csv("titanic.csv")
df.info()
df.head()

In [ ]:
for v in df.Survived.unique():
    print(v, len(df[df.Survived==v]))

In [ ]:
df.Survived.unique()

In [ ]:
df.Survived.value_counts()

In [ ]:
df.groupby(["Survived", "Sex"]).agg(["count"])

# Ch 5.1

In [7]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data, index=['one', 'two', 'three', 'four', 'five', 'six'])
frame

        state  year  pop
one      Ohio  2000  1.5
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nevada  2001  2.4
five   Nevada  2002  2.9
six    Nevada  2003  3.2

In [10]:
frame.loc["one"]

state    Ohio
year     2000
pop       1.5
Name: one, dtype: object

In [38]:
frame["debt"] = np.arange(6)
frame

        state  year  pop  debt
one      Ohio  2000  1.5     0
two      Ohio  2001  1.7     1
three    Ohio  2002  3.6     2
four   Nevada  2001  2.4     3
five   Nevada  2002  2.9     4
six    Nevada  2003  3.2     5

In [39]:
frame["east"] = frame.state == "Ohio"
frame

        state  year  pop  debt   east
one      Ohio  2000  1.5     0   True
two      Ohio  2001  1.7     1   True
three    Ohio  2002  3.6     2   True
four   Nevada  2001  2.4     3  False
five   Nevada  2002  2.9     4  False
six    Nevada  2003  3.2     5  False

In [40]:
del frame["east"]
frame

        state  year  pop  debt
one      Ohio  2000  1.5     0
two      Ohio  2001  1.7     1
three    Ohio  2002  3.6     2
four   Nevada  2001  2.4     3
five   Nevada  2002  2.9     4
six    Nevada  2003  3.2     5

In [43]:
frame.index.name = "ID"
frame

        state  year  pop  debt
ID
one      Ohio  2000  1.5     0
two      Ohio  2001  1.7     1
three    Ohio  2002  3.6     2
four   Nevada  2001  2.4     3
five   Nevada  2002  2.9     4
six    Nevada  2003  3.2     5

# pd.Index()

it can contain duplicate labels

In [ ]:
Index.append()
Index.difference()
Index.intersection()
Index.union()
Index.isin()
Index.delete() #pass index
Index.drop() #pass value, can't drop in case of l
Index.is_monotonic
Index.is_unique
Index.unique()

In [11]:
l = pd.Index([1,1,2,3])
l = l.append(pd.Index([3]))
l

Int64Index([1, 1, 2, 3, 3], dtype='int64')

In [12]:
a = pd.Index(np.arange(6))
a1 = a.append(frame.index)
a1

Index([0, 1, 2, 3, 4, 5, 'one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [13]:
a1.difference(a)

Index(['five', 'four', 'one', 'six', 'three', 'two'], dtype='object')

In [14]:
a1.intersection(a)  # -> common values

Index([0, 1, 2, 3, 4, 5], dtype='object')

In [15]:
a1.union(l) # all values droping duplicates

Index([0, 1, 2, 3, 4, 5, 'five', 'four', 'one', 'six', 'three', 'two'], dtype='object')

In [16]:
l.isin(a1)

array([ True,  True,  True,  True,  True])

In [20]:
print(a1)
a1.delete(-2) #only inline operation

Index([0, 1, 2, 3, 4, 5, 'one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

Index([0, 1, 2, 3, 4, 5, 'one', 'two', 'three', 'four', 'six'], dtype='object')

In [166]:
a1.drop("one") # if any duplicate is in Index then can't drop e.g in case of l

Index([0, 1, 2, 3, 4, 5, 'one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [113]:
l.is_monotonic #Returns True if each element is greater than or equal to the previous element

True

In [116]:
l.is_unique

False

In [118]:
l.unique()

Int64Index([1, 2, 3], dtype='int64')

In [110]:
frame.index.

In [53]:
drop

TypeError: Index does not support mutable operations

# Dropping Entries from an Axis

inline function untill inplace = true

In [180]:
s = pd.Series([1,2,3], index=["a","b","c"])
s

a    1
b    2
c    3
dtype: int64

In [182]:
s.drop("a")

b    2
c    3
dtype: int64

In [183]:
s.drop(["b","c"])

a    1
dtype: int64

In [184]:
s

a    1
b    2
c    3
dtype: int64

In [185]:
s.drop("a", inplace=True)
s

b    2
c    3
dtype: int64

In [186]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [188]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [189]:
data.drop("one", axis=1) #or axis = "columns"

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

# Indexing, Selection, and Filtering

In [5]:
obj = pd.Series(np.arange(1.,5.), index=['a', 'b', 'c', 'd'])
obj

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [6]:
obj[1]

2.0

In [7]:
obj["b"]

2.0

In [13]:
obj[:"c"] #obj[:3] slicing with labels end point is inclusive

a    1.0
b    2.0
c    3.0
dtype: float64

In [18]:
obj["b":"c"] = 5
obj

a    1.0
b    5.0
c    5.0
d    4.0
dtype: float64

In [16]:
obj[[2,3,0]]

c    3.0
d    4.0
a    1.0
dtype: float64

In [20]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [56]:
data[2:3] #data.iloc[2]

      one  two  three  four
Utah    8    9     10    11

In [57]:
data.iloc[2,3] (row,col)

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [58]:
data.iat[2,3] #at specific position by index

11

In [59]:
data.at["Utah","four"] #by label

11

In [62]:
data.get_values()

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [41]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [29]:
data[data["three"]> 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [32]:
data.loc["Ohio",["one","two"]]

one    0
two    1
Name: Ohio, dtype: int32

In [35]:
data.iloc[0,[0,1]]

one    0
two    1
Name: Ohio, dtype: int32

# Arithmetic and Data Alignment

In [219]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [223]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df2.loc[1,"b"] = np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [224]:
df1+df2   #only overlappings add

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [226]:
df1.add(df2) # df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [229]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [232]:
df1.add(df2, fill_value=10)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0  14.0
1   9.0  15.0  13.0  15.0  19.0
2  18.0  20.0  22.0  24.0  24.0
3  25.0  26.0  27.0  28.0  29.0

In [230]:
df1.radd(df2)

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [235]:
df1.rdiv(1) #1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [240]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

# broadcastig between dataframe and series

In [242]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [244]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [245]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [241]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [243]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [ ]:
now column vise

In [246]:
series3 = frame["d"]
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [250]:
frame.add(series3, axis="index") #axis = 0

           b     d     e
Utah     1.0   2.0   3.0
Ohio     7.0   8.0   9.0
Texas   13.0  14.0  15.0
Oregon  19.0  20.0  21.0

In [21]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], index=['a', 'b', 'c', 'd'], columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [278]:
df.sum(axis = 1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [277]:
df.sum(axis = 1, skipna = False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

# Function Application and Mapping

In [251]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [254]:
f = lambda x: x.max() - x.min()
frame.apply(f) #axis = 0/axis = "index" top to bottom

b    9.0
d    9.0
e    9.0
dtype: float64

In [255]:
frame.apply(f, axis=1) #axis = "columns"

Utah      2.0
Ohio      2.0
Texas     2.0
Oregon    2.0
dtype: float64

map for series
applymap for df

In [296]:
frame

       d  a
three  0  1
one    2  3
six    4  5
four   6  7

In [302]:
frame.idxmax() #index where max # idxmin

d    four
a    four
dtype: object

In [309]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals = pd.Series(['c', 'b', 'a'])
pd.Index(unique_vals).get_indexer(to_match)

Index(['c', 'b', 'a'], dtype='object')